* Выполнение диплома

** DONE Заполнить задание на диплом

*** DONE Определиться что у меня за устройство
:LOGBOOK:
CLOCK: [2025-02-27 Чт 14:16]--[2025-02-27 Чт 15:10] =>  0:54
:END:

Я решил, что у меня будет полётный контроллер.
*** DONE Выписать ГОСТы, которые подходят
:LOGBOOK:
CLOCK: [2025-02-27 Чт 16:57]--[2025-02-27 Чт 17:21] =>  0:24
:END:

>>> ГОСТы по полётным контроллерам

*** DONE Выписать параметры электронной схемы
:LOGBOOK:
CLOCK: [2025-02-27 Чт 17:37]--[2025-02-27 Чт 18:08] =>  0:31
:END:

*** DONE Отредактировать лист задания
:LOGBOOK:
CLOCK: [2025-02-27 Thu 19:41]--[2025-02-27 Thu 19:54] =>  0:13
:END:

*** DONE Написать письмо Виктору Сильветстровичу.
:LOGBOOK:
CLOCK: [2025-02-27 Thu 19:56]--[2025-02-27 Thu 20:31] =>  0:35
:END:


** DONE Перевод статьи из журнала
:LOGBOOK:
CLOCK: [2025-03-11 Вт 17:43]--[2025-03-11 Вт 17:52] =>  0:09
CLOCK: [2025-03-11 Вт 16:55]--[2025-03-11 Вт 17:39] =>  0:44
:END:

*** Перевод статьи из журнала / режимы работы
:LOGBOOK:
CLOCK: [2025-03-11 Вт 17:53]--[2025-03-11 Вт 18:08] =>  0:15
:END:

*** Перевод статьи из журнала / режимы отображения
:LOGBOOK:
CLOCK: [2025-03-11 Вт 18:13]--[2025-03-11 Вт 18:25] =>  0:12
:END:

*** Перевод статьи из журнала / схема
:LOGBOOK:
CLOCK: [2025-03-11 Вт 18:28]--[2025-03-11 Вт 18:49] =>  0:21
:END:

*** Перевод статьи из журнала / аналоговые входы
:LOGBOOK:
CLOCK: [2025-03-11 Вт 19:18]--[2025-03-11 Вт 19:35] =>  0:17
:END:

*** Перевод статьи из журнала / проблемы с дисплеем
:LOGBOOK:
CLOCK: [2025-03-11 Вт 19:56]--[2025-03-11 Вт 20:14] =>  0:18
:END:

*** Перевод статьи из журнала / выбор режима работы
:LOGBOOK:
CLOCK: [2025-03-11 Вт 20:20]--[2025-03-11 Вт 20:36] =>  0:16
:END:

*** Перевод статьи из журнала / Прочее
:LOGBOOK:
CLOCK: [2025-03-11 Вт 21:04]--[2025-03-11 Вт 21:12] =>  0:08
:END:

*** Перевод статьи из журнала / несколько слов о ПО
:LOGBOOK:
CLOCK: [2025-03-11 Вт 21:18]--[2025-03-11 Вт 21:33] =>  0:15
:END:

*** Перевод статьи из журнала / Использование библиотеки OLED_I2C
:LOGBOOK:
CLOCK: [2025-03-11 Вт 21:37]--[2025-03-11 Вт 21:49] =>  0:12
:END:

*** Перевод статьи из журнала / Перед включением питания и время взлетать
:LOGBOOK:
CLOCK: [2025-03-11 Вт 21:58]--[2025-03-11 Вт 22:00] =>  0:02
CLOCK: [2025-03-11 Вт 21:50]--[2025-03-11 Вт 21:58] =>  0:08
:END:

*** spell check
:LOGBOOK:
CLOCK: [2025-03-11 Вт 22:00]--[2025-03-11 Вт 22:14] =>  0:14
:END:


** Доработка принципиальной схемы
:LOGBOOK:
CLOCK: [2025-05-08 Чт 16:41]--[2025-05-08 Чт 16:53] =>  0:12
CLOCK: [2025-05-08 Чт 16:04]--[2025-05-08 Чт 16:08] =>  0:04
:END:



*** DONE Развернуть схему на весь лист А2
:LOGBOOK:
CLOCK: [2025-03-22 Сб 15:57]--[2025-03-22 Сб 16:28] =>  0:31
CLOCK: [2025-03-20 Чт 23:30]--[2025-03-20 Чт 23:59] =>  0:29
CLOCK: [2025-03-19 Ср 21:13]--[2025-03-19 Ср 21:43] =>  0:30
:END:



*** DONE Перерисовать LM3852 как стабилитрон с двумя выводами
:LOGBOOK:
CLOCK: [2025-03-23 Вс 20:04]--[2025-03-23 Вс 20:19] =>  0:15
:END:

*** NGMI Перерисовать стабилизатор напряжени DA1 по ГОСТ
:LOGBOOK:
CLOCK: [2025-03-23 Вс 20:25]--[2025-03-23 Вс 20:39] =>  0:14
:END:




** TODO Придумать как соеденить Э1 и Э3 на одном листе
:LOGBOOK:
CLOCK: [2025-05-04 Вс 16:18]--[2025-05-04 Вс 16:23] =>  0:05
:END:
Cкорей всего с помощью inkscape.

** DONE Доработка структурной схемы
:LOGBOOK:
CLOCK: [2025-03-23 Вс 16:39]--[2025-03-23 Вс 16:51] =>  0:12
CLOCK: [2025-03-23 Вс 16:18]--[2025-03-23 Вс 16:26] =>  0:08
CLOCK: [2025-03-23 Вс 16:00]--[2025-03-23 Вс 16:11] =>  0:11
:END:

** Найти (настоящий) децимальный номер для полётного контроллера
:LOGBOOK:
CLOCK: [2025-04-27 Вс 21:15]--[2025-04-27 Вс 21:36] =>  0:21
CLOCK: [2025-03-23 Вс 17:00]--[2025-03-23 Вс 17:33] =>  0:33
:END:

Децимальный номер должен состаять из 6 цифр.
+https://prilan.ru/eskd/46/+
+https://prilan.ru/eskd/46/468/4683/46832/+


https://electronix.ru/forum/topic/199595-klassifikator-eskd-klass-46/

[[file:~/Projects/6sem_coursework/paper/part_1_1.tex::Этот код ГУИР 467993.013. Здесь ГУИР это код предприятия, а 013 порядковый регистрационный номер,][Децимальный номер из курсового шестого семестра]]: 467993.013




** Доработка перечня элементов
:LOGBOOK:
CLOCK: [2025-05-17 Sat 17:40]--[2025-05-17 Sat 18:06] =>  0:26
CLOCK: [2025-05-09 Fri 16:16]--[2025-05-09 Fri 16:20] =>  0:04
CLOCK: [2025-05-09 Fri 16:02]--[2025-05-09 Fri 16:15] =>  0:13
CLOCK: [2025-05-08 Чт 19:48]--[2025-05-08 Чт 19:59] =>  0:11
CLOCK: [2025-05-08 Чт 19:34]--[2025-05-08 Чт 19:42] =>  0:08
CLOCK: [2025-05-08 Чт 18:56]--[2025-05-08 Чт 19:18] =>  0:22
CLOCK: [2025-03-23 Вс 22:07]--[2025-03-23 Вс 22:13] =>  0:06
CLOCK: [2025-03-23 Вс 21:37]--[2025-03-23 Вс 21:42] =>  0:05
:END:

*** DONE Найти значение для диодов шотки

** DONE Отчёт по преддипломной практике

*** DONE Вписать ФИО руководителя практики от предприятия

Руководитель:
Острога Дмитрий Викторович

*** DONE Титульный лист с печатью PlaysDev
DEADLINE: <2025-03-21 Пт>

** DONE План-проспект дипломного проекта.

*** DONE План-проспект / прочитать как писать
:LOGBOOK:
CLOCK: [2025-03-25 Вт 12:28]--[2025-03-25 Вт 12:35] =>  0:07
:END:

https://t-j.ru/guide/how-to-plan-diplom/



*** DONE План-проспект / написание плана
:LOGBOOK:
CLOCK: [2025-03-25 Вт 17:46]--[2025-03-25 Вт 17:52] =>  0:06
CLOCK: [2025-03-25 Вт 17:04]--[2025-03-25 Вт 17:22] =>  0:18
CLOCK: [2025-03-25 Вт 16:05]--[2025-03-25 Вт 16:58] =>  0:53
CLOCK: [2025-03-25 Вт 15:25]--[2025-03-25 Вт 15:52] =>  0:27
CLOCK: [2025-03-25 Вт 14:17]--[2025-03-25 Вт 14:21] =>  0:04
CLOCK: [2025-03-25 Вт 13:52]--[2025-03-25 Вт 14:05] =>  0:13
CLOCK: [2025-03-25 Вт 13:11]--[2025-03-25 Вт 13:23] =>  0:12
CLOCK: [2025-03-25 Вт 12:59]--[2025-03-25 Вт 13:10] =>  0:11
CLOCK: [2025-03-25 Вт 12:56]--[2025-03-25 Вт 12:58] =>  0:02
:END:

** DONE Техническое задание
:LOGBOOK:
CLOCK: [2025-03-26 Ср 21:15]--[2025-03-26 Ср 21:40] =>  0:25
CLOCK: [2025-03-26 Ср 20:33]--[2025-03-26 Ср 20:45] =>  0:12
CLOCK: [2025-03-26 Ср 17:33]--[2025-03-26 Ср 17:44] =>  0:11
CLOCK: [2025-03-26 Ср 16:32]--[2025-03-26 Ср 16:39] =>  0:07
CLOCK: [2025-03-26 Ср 16:26]--[2025-03-26 Ср 16:29] =>  0:03
CLOCK: [2025-03-26 Ср 16:16]--[2025-03-26 Ср 16:21] =>  0:05
CLOCK: [2025-03-26 Ср 16:00]--[2025-03-26 Ср 16:14] =>  0:14
CLOCK: [2025-03-26 Ср 15:48]--[2025-03-26 Ср 15:56] =>  0:08
CLOCK: [2025-03-26 Ср 15:43]--[2025-03-26 Ср 15:46] =>  0:03
:END:



** DONE Забрать задание на диплом
:LOGBOOK:
CLOCK: [2025-03-25 Вт 10:58]--[2025-03-25 Вт 12:07] =>  1:09
:END:

Время занявшее у меня сходить до университета пешком, один раз
подъехав на сотом.


** Проектирование

*** Cхема в SimulIDE
*** Компановки печатной платы
**** Компановка печатной платы / 1
**** Компановка печатной платы / 2
**** Компановка печатной платы / 3

*** Корпус печатной платы
**** Герметичный корпус печатной платы
**** Перфорированный корпус печатной платы

** Моделирование
*** Установить
**** COMSOL Multiphysics / Linux
:LOGBOOK:
CLOCK: [2025-03-27 Чт 23:35]--[2025-03-27 Чт 23:53] =>  0:18
:END:

**** Ansys workbench  / Linux

**** COMSOL Multiphysics  / Windows
:LOGBOOK:
CLOCK: [2025-05-03 Sat 13:29]--[2025-05-03 Sat 13:55] =>  0:26
:END:

**** Ansys workbench / Windows
:LOGBOOK:
CLOCK: [2025-05-12 Mon 19:01]--[2025-05-12 Mon 20:23] =>  1:22
CLOCK: [2025-05-12 Mon 18:03]--[2025-05-12 Mon 18:42] =>  0:39
:END:

**** Solidworks
:LOGBOOK:
CLOCK: [2025-05-12 Mon 15:59]--[2025-05-12 Mon 17:30] =>  1:31
:END:

*** Моделирование в программах
**** COMSOL Multiphysics
**** Ansys workbench
**** Solidworks simulation

** Перенос в записку того что ещё можно перенести из курсового
:LOGBOOK:
CLOCK: [2025-05-04 Вс 18:54]--[2025-05-04 Вс 18:59] =>  0:05
CLOCK: [2025-05-02 Пт 12:08]--[2025-05-02 Пт 12:29] =>  0:21
CLOCK: [2025-03-27 Чт 17:18]--[2025-03-27 Чт 17:19] =>  0:01
CLOCK: [2025-03-27 Чт 16:56]--[2025-03-27 Чт 17:11] =>  0:15
CLOCK: [2025-03-27 Чт 15:57]--[2025-03-27 Чт 16:20] =>  0:23
:END:

Можно перенести расчёт надёжности.

** Разделы пояснительной записки диплома
:LOGBOOK:
CLOCK: [2025-03-27 Чт 13:29]--[2025-03-27 Чт 13:54] =>  0:25
CLOCK: [2025-03-27 Чт 13:17]--[2025-03-27 Чт 13:22] =>  0:05
:END:


*** Анализ литературно патентных исследований

**** Обзор методов и средств управления двигателями мультироторных летательных аппаратов
:LOGBOOK:
CLOCK: [2025-05-02 Пт 12:56]--[2025-05-02 Пт 13:10] =>  0:14
CLOCK: [2025-03-27 Чт 18:02]--[2025-03-27 Чт 18:15] =>  0:13
CLOCK: [2025-03-27 Чт 15:52]--[2025-03-27 Чт 15:55] =>  0:03
CLOCK: [2025-03-27 Чт 14:13]--[2025-03-27 Чт 14:17] =>  0:04
:END:

**** Анализ патентных исследований
:LOGBOOK:
CLOCK: [2025-05-04 Вс 17:56]--[2025-05-04 Вс 18:10] =>  0:14
CLOCK: [2025-05-04 Вс 17:17]--[2025-05-04 Вс 17:27] =>  0:10
:END:

https://worldwide.espacenet.com/patent/search?q=%22flight%20controller%22

https://worldwide.espacenet.com/patent/search?f=cc%3Ain%3Dus%2Cru&q=nftxt%20%3D%20%22flight%20controller%22

***** Патент 1

***** Патент 2

***** Патент 3

***** Патент 4

***** Патент 5

*** Общетехническое обоснование разработки устройства

**** Анализ исходных данных

**** Формирование основных технических требований к разрабатываемой конструкции

*** Схемотехнический анализ радиоэлектронного средства
**** Описание принципа работы проектируемого радиоэлектронного средства.
**** Расчёт электрических параметров и режимов работы отдельных каскадов проектируемого устройства.
*** Разработка конструкции проектируемого изделия
**** Выбор и обоснование элементной базы
**** Выбор типа электричекского монтажа, элементов крепления и фиксации.
**** Выбор способов обеспечения нормального теплового режима
**** Выбор и обоснование метода изготовления печатной платы
**** Выбор конструкторских решений обеспечивающих удобство ремонта
**** Технология разработки чертежа детали в среде KiCAD
**** Обеспечение требований стандартизации, унификации и технологичности конструкции устройства

*** Расчет параметров проектируемого изделия

**** Расчёт теплового режима.

**** Расчёт на механические воздействия

**** Расчёт конструктивно-технологических параметров печатных плат

**** Расчёт электромагнитной совместимости

**** Полный расчёт надёжности
:LOGBOOK:
CLOCK: [2025-05-17 Sat 19:27]--[2025-05-17 Sat 20:19] =>  0:52
CLOCK: [2025-05-17 Sat 18:15]--[2025-05-17 Sat 18:32] =>  0:17
:END:


*** Моделирование физических процессов, протекающих в проектируемом радиоэлектронном средстве

**** Обоснование выбора ПО

**** Компоненты математического обеспечения

**** Технология построения трехмерных моделей исследуемого устройства

**** Технология моделирования тепловых процессов

**** Технология моделирования движения воздуха в корпусах РЭС

**** Обработка, анализ и интерпертация данных

*** Экономическое обоснование (2-я опроцентовка)
:LOGBOOK:
CLOCK: [2025-05-16 Fri 21:08]--[2025-05-16 Fri 22:03] =>  0:55
CLOCK: [2025-05-16 Fri 18:48]--[2025-05-16 Fri 20:40] =>  1:52
CLOCK: [2025-05-16 Fri 17:26]--[2025-05-16 Fri 18:38] =>  1:12
CLOCK: [2025-05-16 Fri 16:41]--[2025-05-16 Fri 16:43] =>  0:02
CLOCK: [2025-05-16 Fri 15:39]--[2025-05-16 Fri 16:33] =>  0:54
CLOCK: [2025-05-16 Fri 15:18]--[2025-05-16 Fri 15:26] =>  0:08
CLOCK: [2025-05-14 Wed 14:24]--[2025-05-14 Wed 14:41] =>  0:17
CLOCK: [2025-05-14 Wed 14:01]--[2025-05-14 Wed 14:18] =>  0:17
CLOCK: [2025-05-13 Tue 21:46]--[2025-05-13 Tue 22:02] =>  0:16
CLOCK: [2025-05-13 Tue 21:16]--[2025-05-13 Tue 21:43] =>  0:27
CLOCK: [2025-05-13 Tue 21:02]--[2025-05-13 Tue 21:07] =>  0:05
CLOCK: [2025-05-13 Tue 20:10]--[2025-05-13 Tue 20:53] =>  0:43
CLOCK: [2025-05-13 Tue 18:18]--[2025-05-13 Tue 18:25] =>  0:07
CLOCK: [2025-05-13 Tue 17:48]--[2025-05-13 Tue 18:06] =>  0:18
CLOCK: [2025-05-13 Tue 16:20]--[2025-05-13 Tue 17:03] =>  0:43
CLOCK: [2025-05-13 Tue 15:30]--[2025-05-13 Tue 15:54] =>  0:24
CLOCK: [2025-05-11 Sun 17:14]--[2025-05-11 Sun 17:58] =>  0:44
CLOCK: [2025-05-11 Sun 17:03]--[2025-05-11 Sun 17:06] =>  0:03
CLOCK: [2025-05-11 Sun 16:45]--[2025-05-11 Sun 16:48] =>  0:03
CLOCK: [2025-05-11 Sun 15:40]--[2025-05-11 Sun 16:07] =>  0:27
CLOCK: [2025-05-10 Sat 21:29]--[2025-05-10 Sat 21:37] =>  0:08
CLOCK: [2025-05-10 Sat 20:52]--[2025-05-10 Sat 21:05] =>  0:13
CLOCK: [2025-05-10 Sat 20:35]--[2025-05-10 Sat 20:47] =>  0:12
CLOCK: [2025-05-10 Sat 19:42]--[2025-05-10 Sat 20:16] =>  0:34
CLOCK: [2025-05-10 Sat 17:42]--[2025-05-10 Sat 17:57] =>  0:15
CLOCK: [2025-05-10 Sat 16:41]--[2025-05-10 Sat 16:52] =>  0:11
CLOCK: [2025-05-10 Sat 16:13]--[2025-05-10 Sat 16:28] =>  0:15
CLOCK: [2025-05-09 Fri 15:30]--[2025-05-09 Fri 15:37] =>  0:07
CLOCK: [2025-05-09 Fri 15:14]--[2025-05-09 Fri 15:16] =>  0:02
CLOCK: [2025-05-08 Чт 15:56]--[2025-05-08 Чт 15:57] =>  0:01
CLOCK: [2025-05-08 Чт 15:14]--[2025-05-08 Чт 15:21] =>  0:07
CLOCK: [2025-05-06 Вт 15:08]--[2025-05-06 Вт 15:19] =>  0:11
CLOCK: [2025-05-06 Вт 14:23]--[2025-05-06 Вт 15:06] =>  0:43
CLOCK: [2025-05-06 Вт 13:51]--[2025-05-06 Вт 14:03] =>  0:12
CLOCK: [2025-05-06 Вт 13:13]--[2025-05-06 Вт 13:27] =>  0:14
:END:
ЭКОНОМИЧЕСКОЕ ОБОСНОВАНИЕ РАЗРАБОТКИ И ПРОИЗВОДСТВА НОВОГО ИЗДЕЛИЯ

https://www.bsuir.by/m/12_100229_1_161144.pdf

https://www.bsuir.by/m/12_100229_1_147164.pdf

>>> экономическое обоснование

| 1) кто будет пользователем Вашей разработки                                                                              | Разработчики БПЛА                     |
| 2) какую проблему этого пользователя она будет решать                                                                    | Проблема управления двигателями       |
| 3) какие существуют конкурентные аналоги и альтернативы                                                                  | TODO                                  |
| 4) почему Ваша разработка окажется для пользователя более предпочтительной по сравнению с этими аналогами/альтернативами | Почему моя разработка предпочтительна |



** Поиск источников
:LOGBOOK:
CLOCK: [2025-03-25 Вт 12:51]--[2025-03-25 Вт 12:54] =>  0:03
:END:

>>> диплом

https://github.com/stars/artsi0m/lists/flight-controller-diploma

** Коммитить изменения в git
:LOGBOOK:
CLOCK: [2025-03-25 Вт 18:14]--[2025-03-25 Вт 18:17] =>  0:03
CLOCK: [2025-03-25 Вт 12:47]--[2025-03-25 Вт 12:48] =>  0:01
CLOCK: [2025-03-25 Вт 12:35]--[2025-03-25 Вт 12:37] =>  0:02
:END:

** Проверка орфографии (spellcheck)
:LOGBOOK:
CLOCK: [2025-03-26 Ср 21:41]--[2025-03-26 Ср 21:50] =>  0:09
CLOCK: [2025-03-25 Вт 17:55]--[2025-03-25 Вт 17:58] =>  0:03
CLOCK: [2025-03-25 Вт 14:11]--[2025-03-25 Вт 14:16] =>  0:05
CLOCK: [2025-03-25 Вт 14:05]--[2025-03-25 Вт 14:07] =>  0:02
:END:

About hunspell on windows:
https://www.gnu.org/software/emacs/manual/html_node/efaq-w32/Spell-check.html

** Форматирование пояснительной записки

*** Ручное форматирование
:LOGBOOK:
CLOCK: [2025-03-25 Вт 18:06]--[2025-03-25 Вт 18:09] =>  0:03
CLOCK: [2025-03-25 Вт 17:59]--[2025-03-25 Вт 18:03] =>  0:04
:END:

*** Доработка latex класса

*** Переезд записки с xelatex на luatex


** Нормоконтроль

*** DONE Написать Ефремовой
:LOGBOOK:
CLOCK: [2025-03-26 Ср 15:07]--[2025-03-26 Ср 15:08] =>  0:01
CLOCK: [2025-03-26 Ср 14:05]--[2025-03-26 Ср 14:08] =>  0:03
:END:


** Исправление недочётов с первой опроцентовки

*** TODO Увеличить шрифт пинов у микроконтроллера

*** TODO Найти УГО пищалки и если оно отличается, то перерисовать

*** DONE Заменить на структурной схеме Э3 на Э1

*** TODO В перечне убрать строчки в конце листа

*** TODO В перечне штырьевые разъёмы должны обозначаться своим типом

*** TODO Исправить опечатку в целях и назначениях разработки в ТЗ

*** DONE В ТЗ указать журнал там где «слова другая документация»

*** DONE В ТЗ 100ВТ заменить на 100 Вт.

*** TODO Выполнить расчёт для тразнистора рядом с пищалкой в пункте 3.2

*** DONE Прислать перевод статьи из журнала на почту

*** DONE Переанатировать схему
:LOGBOOK:
CLOCK: [2025-04-27 Вс 20:47]--[2025-04-27 Вс 20:51] =>  0:04
:END:

*** TODO Cделать справку о патентном поиске


** 2-я опроцентовка

*** TODO Cборочный чертеж изделия

*** TODO Чертежи нестандартных деталей (корпус)

